export interface ServiceData {
  id: string;
  title: string;
  subtitle: string;
  image_url: string;
  description: string[];
  url: string;
  metaTitle?: string;
  metaDescription?: string;
}

export const SERVICES_DATA: ServiceData[] = [
  {
    id: "programma-exoikonomo",
    title: "Πρόγραμμα Εξοικονομώ",
    subtitle:
      "Προγράμματα Εξοικονομώ Ολοκληρωμένες Λύσεις Ενεργειακής Αναβάθμισης",
    image_url: "/images/exoikonomo.jpg",
    description: [
      "Η εταιρεια μας, με πολυετη εμπειρια και συνεχη δραστηριοτητα στα Προγραμματα Εξοικονομω στη Θεσσαλονικη, προσφερει ολοκληρωμενες λυσεις για την ενεργειακη αναβαθμιση κατοικιων και επαγγελματικων χωρων.",
      "Αναλαμβανουμε ολες τις διαδικασιες για ενταξης στο προγραμμα, απο την αρχικη αξιολογηση μεχρι την τελικη υλοποιηση των παρεμβασεων.",
    ],
    url: "/programma-exoikonomo",
    metaTitle: "Προγράμματα Εξοικονομώ στη Θεσσαλονίκη",
    metaDescription:
      "Προγράμματα Εξοικονομώ στη Θεσσαλονίκη – Ολοκληρωμένες Λύσεις Ενεργειακής Αναβάθμισης",
  },
  {
    id: "anakainiseis",
    title: "Ανακαινίσεις",
    subtitle:
      "Ανακαινίσεις: Ολοκληρωμένες Λύσεις για Κατοικίες & Επαγγελματικούς Χώρους",
    image_url:
      "https://images.unsplash.com/photo-1634586648651-f1fb9ec10d90?q=80&w=2671&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    description: [
      "Αναζητάτε αξιόπιστη εταιρεία για ανακαινίσεις στη Θεσσαλονίκη; Είτε πρόκειται για την ανακαίνιση της κατοικία σας, την αναδιαμόρφωση του επαγγελματικού σας χώρου ή την αισθητική και λειτουργική αναβάθμιση ενός ακινήτου προς πώληση ή ενοικιαση, η ομάδα μας είναι δίπλα σας με ολοκληρωμένες λύσεις.",
    ],
    url: "/anakainiseis",
    metaTitle: "Ανακαινίσεις στη Θεσσαλονίκη",
    metaDescription:
      "Ανακαινίσεις στη Θεσσαλονίκη – Ολοκληρωμένες Λύσεις για Κατοικίες & Επαγγελματικούς Χώρους",
  },
  {
    id: "fotovoltaika",
    title: "Φωτοβολταικά",
    subtitle: "Φωτοβολταικά Συστήματα για Οικίες & Επιχειρήσεις – Θεσσαλονίκη",
    image_url: "/images/fotovoltaika.jpg",
    description: [
      'Η εταιρεια μας, με έδρα την θεσσαλονικη, προσφερει ολοκληρωμενες λυσεις φωτοβολταικων συστηματων "με το κλειδι στο χερι" για οικιακες και επαγγελματικες εγκαταστασεις.',
    ],
    url: "/fotovoltaika",
    metaTitle: "Φωτοβολταϊκά Συστήματα για Οικίες & Επιχειρήσεις – Θεσσαλονίκη",
    metaDescription:
      "Φωτοβολταϊκά Συστήματα για Οικίες & Επιχειρήσεις – Θεσσαλονίκη - Εξοικονόμηση – Αυτονομία – Πράσινη Ενέργεια",
  },
  {
    id: "antlies-thermothtas",
    title: "Αντλίες Θερμότητας",
    subtitle:
      "Αντλίες Θερμότητας – Οικονομική & Αποδοτική Λύση για Θέρμανση και Ψύξη",
    image_url: "/images/antlies-thermothtas.jpg",
    description: [
      "Αναζητάτε μια αποδοτική και οικονομική λύση για τη θέρμανση και την ψύξη του χώρου σας; Η αντλία θερμότητας είναι η ιδανική επιλογή!",
      "Η RePower Solutions, με έδρα τη Θεσσαλονίκη, εξειδικεύεται στην εγκατάσταση αντλιών θερμότητας, προσφέροντας αξιόπιστες και βιώσιμες λύσεις για κάθε τύπο κατοικίας ή επαγγελματικού χώρου.",
    ],
    url: "/antlies-thermothtas",
    metaTitle: "Αντλίες Θερμότητας στη Θεσσαλονίκη",
    metaDescription:
      "Αντλίες Θερμότητας στη Θεσσαλονίκη – Οικονομική & Αποδοτική Λύση για Θέρμανση και Ψύξη",
  },
  {
    id: "texnikos-asfaleias",
    title: "Τεχνικός Ασφαλείας",
    subtitle:
      "Τεχνικός Ασφαλείας στη Θεσσαλονίκη – Υποστήριξη για Επιχειρήσεις",
    image_url: "/images/texnikos-asfaleias.jpg",
    description: [
      "Ο Τεχνικός Ασφαλείας αποτελεί βασικό σύμμαχο κάθε επιχείρησης για τη διασφάλιση της ασφάλειας και υγείας στον χώρο εργασίας.",
      "Η ομάδα μας, με έδρα τη Θεσσαλονίκη, προσφέρει αξιόπιστες συμβουλευτικές και υποστηρικτικές υπηρεσίες σε μικρές και μεγάλες επιχειρήσεις, ανεξαρτήτως κλάδου.",
    ],
    url: "/texnikos-asfaleias",
    metaTitle: "Τεχνικός Ασφαλείας στη Θεσσαλονίκη",
    metaDescription:
      "Τεχνικός Ασφαλείας στη Θεσσαλονίκη – Υποστήριξη για Επιχειρήσεις",
  },
  {
    id: "pistopoihtiko",
    title: "Ενεργειακος Επιθεωρητης",
    subtitle:
      "Πιστοποιητικό Ενεργειακής Απόδοσης (ΠΕΑ) – Ενεργειακός Επιθεωρητής",
    image_url: "/images/pistopoihtiko.jpg",
    description: [
      "Το Πιστοποιητικό Ενεργειακής Απόδοσης (ΠΕΑ) είναι το επίσημο έγγραφο που αξιολογεί την ενεργειακή κατανάλωση ενός ακινήτου και το κατατάσσει σε ενεργειακή κατηγορία, από Α+ (υψηλή απόδοση) έως Η (χαμηλή απόδοση). Παράλληλα, περιλαμβάνει προτάσεις ενεργειακής αναβάθμισης για μείωση της κατανάλωσης και εξοικονόμηση κόστους.",
    ],
    url: "/pistopoihtiko",
    metaTitle:
      "Πιστοποιητικό Ενεργειακής Απόδοσης (ΠΕΑ) – Ενεργειακός Επιθεωρητής Θεσσαλονίκη",
    metaDescription:
      "Πιστοποιητικό Ενεργειακής Απόδοσης (ΠΕΑ) – Ενεργειακός Επιθεωρητής Θεσσαλονίκη",
  },
  {
    id: "hm-meletes",
    title: "Η/Μ Μελετες",
    subtitle: "Ηλεκτρομηχανολογικές Μελέτες (Η/Μ) στη Θεσσαλονίκη",
    image_url: "/images/hm-meletes.jpg",
    description: [
      "Η εταιρεία μας, με έδρα τη Θεσσαλονίκη, εξειδικεύεται στην εκπόνηση Ηλεκτρομηχανολογικών Μελετών (Η/Μ) για κάθε τύπο κτιριακής ή βιομηχανικής εγκατάστασης.",
      "Στόχος μας είναι η παροχή ολοκληρωμένων, κατασκευαστικά και ενεργειακά βέλτιστων λύσεων, προσαρμοσμένων στις ανάγκες κάθε έργου.",
    ],
    url: "/hm-meletes",
    metaTitle: "Ηλεκτρομηχανολογικές Μελέτες (Η/Μ) στη Θεσσαλονίκη",
    metaDescription: "Ηλεκτρομηχανολογικές Μελέτες (Η/Μ) στη Θεσσαλονίκη",
  },
  {
    id: "oikodomikes-adeies",
    title: "Οικοδομικές Αδειες",
    subtitle:
      "Εκδοση Οικοδομικής Αδειας Ολοκληρωμένη Διαχείριση Οικοδομικών Αδειών",
    image_url:
      "https://images.unsplash.com/photo-1660594161043-28b49b363632?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    description: [
      "Στη RePower Solutions, αναλαμβάνουμε την πλήρη διαδικασία έκδοσης οικοδομικής άδειας στη Θεσσαλονίκη και σε όλη την Ελλάδα, με συνέπεια, διαφάνεια και τεχνική αρτιότητα.",
    ],
    url: "/oikodomikes-adeies",
    metaTitle: "Έκδοση Οικοδομικής Άδειας στη Θεσσαλονίκη – RePower Solutions",
    metaDescription:
      "Έκδοση Οικοδομικής Άδειας στη Θεσσαλονίκη – RePower Solutions - Ολοκληρωμένη Διαχείριση Οικοδομικών Αδειών από Μηχανικούς με Εμπειρία",
  },
  {
    id: "adeies-leitourgias",
    title: "Αδειες Λειτουργίας",
    image_url:
      "https://images.unsplash.com/photo-1603796846097-bee99e4a601f?q=80&w=1374&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    subtitle:
      "Νόμιμη και Αμεση Εναρξη της Επιχείρησής σας με Πλήρης Υποστήριξη",
    description: [
      "Στη RePower Solutions, εξειδικευόμαστε στην έκδοση άδειας λειτουργίας για επιχειρήσεις στη Θεσσαλονίκη, αναλαμβάνοντας όλη τη διαδικασία από το μηδέν μέχρι την τελική έγκριση.",
      "Με γνώση της νομοθεσίας, των τοπικών ιδιαιτεροτήτων και με πολυετή εμπειρία στον χώρο των κατασκευών και των αδειοδοτήσεων, εξασφαλίζουμε έγκυρα, γρήγορα και χωρίς ταλαιπωρία την αδειοδότηση της επιχείρησής σας.",
    ],
    url: "/adeies-leitourgias",
    metaTitle: "Έκδοση Άδειας Λειτουργίας στη Θεσσαλονίκη – RePower Solutions",
    metaDescription:
      "Νόμιμη και Άμεση Έναρξη της Επιχείρησής σας, με Πλήρη Υποστήριξη από Εξειδικευμένους Μηχανικούς",
  },
  {
    id: "meletes-pyrasfaleias",
    title: "Μελέτες Πυρασφάλειας",
    image_url:
      "https://images.unsplash.com/photo-1583683402528-8b6e3002ffda?q=80&w=1320&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    subtitle:
      "Εγκυρες, Εγκεκριμένες Μελέτες Πυρασφάλειας από Εξειδικευμένους Μηχανικούς",
    description: [
      "Η RePower Solutions, τεχνική και κατασκευαστική εταιρεία με έδρα τη Θεσσαλονίκη, παρέχει ολοκληρωμένες υπηρεσίες μελέτης και έκδοσης πιστοποιητικών πυρασφάλειας για επαγγελματικούς και ιδιωτικούς χώρους.",
      "Η μελέτη πυρασφάλειας αποτελεί υποχρεωτικό έγγραφο για τη νόμιμη λειτουργία πολλών επιχειρήσεων, αλλά και απαραίτητο στοιχείο για την έκδοση άδειας λειτουργίας.",
    ],
    url: "/meletes-pyrasfaleias",
    metaTitle:
      "Έγκυρες, Εγκεκριμένες Μελέτες Πυρασφάλειας από Εξειδικευμένους Μηχανικούς",
    metaDescription:
      "Έγκυρες, Εγκεκριμένες Μελέτες Πυρασφάλειας από Εξειδικευμένους Μηχανικούς",
  },
  {
    id: "afthereta",
    title: "Τακτοποίηση Αυθαιρέτων",
    image_url:
      "https://images.unsplash.com/photo-1730473313094-dc277964d872?q=80&w=1332&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    subtitle:
      "Νόμιμη Ρύθμιση Αυθαίρετων Κατασκευών & Χρήσεων από Εξειδικευμένους Μηχανικούς",
    description: [
      "Αναλαμβάνουμε υπεύθυνα και με απόλυτη νομιμότητα τη διαδικασία τακτοποίησης αυθαιρέτων για ιδιώτες, επαγγελματίες και επιχειρήσεις.",
      "Η τακτοποίηση αυθαιρέτων είναι απαραίτητη για τη μεταβίβαση ακινήτων, την έκδοση οικοδομικών αδειών, την αδειοδότηση επιχειρήσεων ή τη νομιμοποίηση αλλαγών που έχουν γίνει χωρίς άδεια.",
      "Αναλαμβάνουμε εξολοκλήρου τη διαδικασία, με αξιοπιστία και πλήρησυμμόρφωση με τον Ν.4495/2017 και τις πρόσφατες τροποποιήσεις.",
    ],
    url: "/afthereta",
    metaTitle: "Τακτοποίηση Αυθαιρέτων στη Θεσσαλονίκη – RePower Solutions",
    metaDescription:
      "Νόμιμη Ρύθμιση Αυθαίρετων Κατασκευών & Χρήσεων από Εξειδικευμένους Μηχανικούς",
  },
  {
    id: "hlektronikh-taytothta",
    title: "Ηλεκτρονική Ταυτότητα Κτιρίου",
    image_url:
      "https://images.unsplash.com/vector-1739805925567-c19c8860e69d?q=80&w=1480&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    subtitle: "Αμεση Έκδοση Ηλεκτρονικής Ταυτότητας για Ακίνητα κάθε τύπου",
    description: [
      "Προσφέρουμε ολοκληρωμένες υπηρεσίες για την έκδοση Ηλεκτρονικής Ταυτότητας Κτιρίου ή Αυτοτελούς Διηρημένης Ιδιοκτησίας, όπως ορίζει η σύγχρονη πολεοδομική νομοθεσία.",
      "Η Ηλεκτρονική Ταυτότητα Κτιρίου αποτελεί υποχρεωτικό έγγραφο για μεταβίβαση ακινήτου, καθώς και για νομικές ή τεχνικές διαδικασίες που αφορούν το ακίνητο (όπως τακτοποίηση αυθαιρέτων, έκδοση οικοδομικής άδειας, ενεργειακή αναβάθμιση κ.ά.).",
    ],
    url: "/hlektronikh-taytothta",
    metaTitle:
      "Ηλεκτρονική Ταυτότητα Κτιρίου στη Θεσσαλονίκη – RePower Solutions",
    metaDescription:
      "Άμεση Έκδοση Ηλεκτρονικής Ταυτότητας για Ακίνητα κάθε τύπου",
  },
];
